"""
案例：深浅拷贝.

记忆(总结)：
    1. 所谓的深浅拷贝分别指的是 copy 模块的copy()， copy模块的deepcopy()
    2. 大白话解释深浅拷贝：
        深拷贝拷贝的多，浅拷贝拷贝的少
    3. 深浅拷贝主要是针对于[可变类型]来讲的，深拷贝拷贝所有层(可变),浅拷贝只拷贝第1层(可变)
        如果是针对[不可变类型]，则用法和 普通赋值一样，并无区别


"""

# 导入copy包
import copy


def dm01_普通赋值():
    # 普通赋值之不可变类型
    a = 10
    b = a
    print("id(a) ->", id(a))
    print("id(b) ->", id(b))
    print("id(10) ->", id(10))

    # 普通赋值之 可变类型
    a = [1, 2, 3]
    b = [11, 22, 33]
    c = [a, b]
    d = c
    print("id(c) ->", id(c))
    print("id(d) ->", id(d))


def dm02_浅拷贝可变类型():
    a = [1, 2, 3]
    b = [11, 22, 33]
    c = [6, 7, a, b]

    # 测试1 id(c)和id(d)
    d = copy.copy(c)  # 浅拷贝 只会拷贝可变类型的第1层数据
    print("id(c) ->", id(c))  # 0x03
    print("id(d) ->", id(d))  # 0x04
    print("id(c)和id(d)值不一样，说明浅拷贝第1层(最外面一层的数据)")

    # 测试2
    print(id(c[2]))
    print(id(a))

    # 修改a[2] = 22
    a[2] = 22
    # c[0] = 100
    print("c ->", c)
    print("d ->", d)


# 浅拷贝不可变类型：不会给拷贝的对象c开辟新的内存空间，而只拷贝了这个对象的引用
def dm03_浅拷贝不可变类型():

    # 不可变类型 a b c
    a = (1, 2, 3)
    b = (11, 22, 33)
    c = (6, 7, a, b)

    d = copy.copy(c)
    print("id(c) ->", id(c))
    print("id(d) ->", id(d))
    print("id(c)和id(d)值一样，说明c和d指向相同的内存空间")


def dm04_深拷贝可变类型():
    a = [1, 2, 3]
    b = [11, 22, 33]
    c = [6, 7, a, b]

    d = copy.deepcopy(c)  # 深拷贝 拷贝所有层数据
    print("id(c) ->", id(c))
    print("id(d) ->", id(d))

    a[1] = 100
    b[1] = 800
    print(f"c -> {c}")  # c -> [6, 100, [1, 2, 3], [11, 800, 33]]
    """
    实际上，将[1, 2, 3]拆开来看，[1, 2, 3]是一个对象
    本质上是将1,2,3的指针存储在了这个列表对象中，c[0] -> 1，如果将c[0]的值改变了
    实际上是将c[0]的指针改变，而非将c[0]指向的改变，所以列表可以看成一堆指针的集合
    """
    print(f"d -> {d}")


# 浅拷贝不可变类型：不会给拷贝的对象c开辟新的内存空间，而只拷贝了这个对象的引用
def dm05_深拷贝不可变类型():
    a = (1, 2, 3)
    b = (11, 22, 33)
    c = (6, 7, a, b)

    d = copy.deepcopy(c)
    print("id(c) ->", id(c))
    print("id(d) ->", id(d))


if __name__ == "__main__":
    # dm01_普通赋值()
    # dm02_浅拷贝可变类型()
    # dm03_浅拷贝不可变类型()
    # dm04_深拷贝可变类型()
    dm05_深拷贝不可变类型()
